{
    "title": "MaidsWithGuns' Portfolio",
    "welcomeMessage": "Welcome to my portfolio! I am a game programmer/generalist",
    "Block": {
        "launchDate": "Launch Date:",
        "none": "None",
        "info": "Details",
        "officialPage": "Official Page",
        "nintendoPage": "Nintendo Page",
        "playstationPage": "Playstation Page",
        "xboxPage": "Xbox Page"
    },
    "Date a Bullet": {
        "title": "Date a Bullet Fan Game",
        "description": "This game is unofficial and has no affiliation with Kadokawa or the \"Date A Live\" / \"Date A Bullet\" group. Over the past year, I have been developing \"Date A Bullet\" as a game creator alongside @Randamu3DModels as a 3D modeler. I am responsible for the programming, animation, design, etc., but the song and character design of Kurumi Tokisaki are not my creations. \"Date A Bullet\" is built using the Unity game engine and is an hack-and-slash 3D action game.",
        "subtitle": "Game Screenshots",
        "p1": "Date a Bullet is a frenetic action game based on games like Devil May Cry and Yakuza, focusing on combos. The goal is to provide an enjoyable game experience while following the light novel's story. Currently in the prototype stage, it is playable on itch.io. Feedback from players has been very positive, with optimizations already in place.",
        "label1": "There is a gameplay video captured by 'Speeze' on November 18, 2023, but its content is outdated.",
        "subtitle2": "Game Mechanics",
        "p2": "The game incorporates elements of rock-paper-scissors throughout the gameplay. Players can use fast attacks against distant enemies, long-range attacks against heavy enemies, and heavy attacks against fast enemies.",
        "p3": "Various systems are implemented to provide a more complex gameplay experience, including dash, aiming, charge attacks, poise, and a combo system. Each gameplay style offers rewards in different ways.",
        "p4": "Additionally, there's a 'special bullet' system for Kurumi, utilizing Zaphkiel's power to affect herself or enemies. To activate these special bullets, players need to defeat enemies and fill up a time bar. Special bullets have effects like healing, speed boost, clone creation, and time stop.",
        "p5": "The game also features a record-based upgrade and reward system.",
        "subtitle3": "Kurumi Tokisaki's 3D Model",
        "p6": "This temporary model was created using Vroid and it's planned to be changed later.",
        "subtitle4": "Animations/Effects/Sound Design",
        "p7": "I used Cascadeur to create the animations and Audacity to create the sound effects.",
        "subtitle5": "Scenarios",
        "p8": "I've built this scenario with optimization in mind. It runs at above 100 FPS on a GTX 1050 2gb. The scenario is also designed to be modular, allowing for easy expansion and reuse of assets.",
        "subtitle6": "Tsuan boss fight"
    },
    "Bakutara Bokaam": {
        "title": "Bakutara Bokaam!!",
        "description": "This is the first game I created while leading a team. I also guided others to work on the game. It's a free and simple game made in 2 weeks, but the assets are sold separately. @Randamu3dModels handled the 3D models for Bakutara, @bigscaryindian was responsible for the game's music, and I handled everything else. This was a project based on the idea of creating something playable from start to finish, and it can be played online.",
        "subtitle": "Game Screenshots",
        "p1": "The gameplay is simple: bombs appear, and the goal is to keep them divided between red and black for as long as possible. You can use scores to customize Bakutara.",
        "label1": "The gameplay video was recorded by 'Legend' on July 29, 2023.",
        "subtitle2": "Game Illustrations and Concept Art",
        "p2": "I also created illustrations and concept art for the game."
    },
    "Unusual Scientist": {
        "title": "Unusual Scientist",
        "description": "A game created solo for a game jam in less than 5 days. It is playable online.",
        "subtitle": "Game Screenshots",
        "p1": "It's a simple top-down game with arcade-style gameplay based on scores. Players play as a scientist defeating zombies and obtaining upgrades and different weapons."
    },
    "Broken Bones": {
        "title": "Broken Bones",
        "description": "This is my first commercial release. It's a mobile game with simple gameplay and 30 levels. It was created in 3 weeks. It has already achieved over 1000 downloads and can be downloaded for free from the Play Store.",
        "subtitle": "Game Screenshots",
        "p1": "The objective is to navigate through the levels on a bike, collecting three additional stars on each level without hitting your head on the ground. Using these stars, players can customize characters and bikes, and even unlock additional levels. The average rating for Broken Bones on the Play Store is 4.3."
    },
    "Multiplayer Project": {
        "title": "Multiplayer Project",
        "description": "The Multiplayer Project was designed to learn about creating more sophisticated games and structures. It was the final presentation project for a multimedia course. Through this project, I learned about scaling projects, implementing multiplayer using Unity and Mirror, and how to implement everything required for a complete game.",
        "subtitle": "Game Screenshots",
        "p1": "The main gameplay was an FPS multiplayer with a variety of weapons. Assets from \"HQ FPS Weapons\", \"Subway / Metro / Train station Modular Pack\", and \"Mixamo\" were used. The goal was to understand the functionality of the \"HQ FPS Weapons\" system, replicate it, and then add and modify content to fit my needs. Additionally, realistic assets were created for scenarios like the desert post-apocalyptic setting.",
        "deletedContentTitle": "Deleted Content",
        "p2": "There were also keys that provided random items during the game. Zombies were also introduced, and a dismemberment system was implemented. However, all of these were removed and not shown in the trailer."
    },
    "Taiko No Tatsujin": {
        "title": "Taiko no Tatsujin: Scratch Edition",
        "description": "My first game. It was created from scratch. It's a constrained website designed to learn basic game development. While I didn't complete it, over 5000 people played it. It's a version of the 'Taiko no Tatsujin' game recreated in Scratch.",
        "subtitle": "Game Screenshots",
        "p1": "This game is a rather incomplete version of Taiko no Tatsujin made for Scratch. There are also options for customization and music selection."
    },
    "S Prysm Destroyer": {
        "title": "S. Prysm Destroyer",
        "description": "A contra-style action game with mechas and cute anime girls. From drawings to programing, animation, marketing campaign and publishing was done by me except music. It is playable on Steam, with achievements and Highscore. Features crossovers from Situation Succ and Touhou Project.",
        "subtitle": "Game Screenshots",
        "p1": "A 2D platform shooter where you DESTROY!! Get Elemental Powers from the Prysms and help Amor defeat the Primordial Threats agains Humanity! Get cute costumes and be stylish!",
        "label1": "Video trailer",
        "subtitle2": "Game Mechanics",
        "p2": "The game has a simple control scheme, with a focus on fast-paced action. Players can jump, shoot, and use elemental powers to defeat enemies. The game also features a variety of enemies, each with unique attack patterns and weaknesses.",
        "p3": "It has some unique features where players can get temporary upgrades throughout the levels, a combo system that rewards players with fast paced movement, a jetpack for flying and special 'prysms' in each level that activates a special power for some limited time.",
        "subtitle3": "3D Models",
        "subtitle4": "Transformation Animation",
        "subtitle5": "Gameplay video",
        "label2": "Video made by 'Twisted Banana Produtions' on build 1.0.3",
        "subtitle6": "Other Platforms"
    }  
}