{
    "title": "MaidsWithGunsの   ポートフォリオ",
    "welcomeMessage": "このウェブサイトにようこそ！ 私はゲームプログラマー/ジェネラリストです",
    "Block": {
        "launchDate": "発売日:",
        "none": "なし",
        "info": "もっと知る",
        "officialPage": "公式ページへ",
        "nintendoPage": "任天堂ページへ",
        "playstationPage": "プレイステーションページへ",
        "xboxPage": "Xboxページへ"
    },
    "Date a Bullet": {
        "title": "デート・ア・バレット 同人ゲーム",
        "description": "このゲームは正式ではないし角川会社と「デート・ア・ライブ」/「デート・ア・バレット」」団体と関係ありません。一年間で、私は、ゲームクレアタスとして、@Randamu3DModelsと、3Dモデラーとして、「デート・ア・バレット」を発展中です。 プログラミングとか、アニメーションとか、デサイーとか、私が作りましたてでも、歌とか時崎狂三のキャラクターデザインは私の創作ございません。「デート・ア・バレット」はUnityのゲームエンジン作りているて、アクションハックアンドスラッシュの3Dゲームです。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "デート・ア・バレットは、デビル メイ クライや龍が如くのようなゲームを基にした、コンボによるフレンティックなアクションゲームです。目標はライトノベルのストーリーに従いつつ、ユーザーに楽しいゲームを提供することです。現在はプロトタイプの段階で、itch.ioでプレイ可能です。これまでにプレイした人々からのフィードバックは非常に好評で、最適化もされているとのことです。",
        "label1": "2023年11月18日に 'Speeze' によって撮影されたゲームプレイ動画がありますが、内容は古いものです。",
        "subtitle2": "ゲームの仕組み",
        "p2": "ゲームプレイ全体にじゃん拳の要素が組み込まれています。プレイヤーは遠距離の敵に対して速い攻撃、重い敵に対しては遠距離攻撃、速い敵に対しては重い攻撃を使用することができます。",
        "p3": "ダッシュ、照準、チャージ攻撃、ポイズ、コンボシステムなど、より複雑なゲームプレイを提供するさまざまなシステムが実装されています。各ゲームプレイスタイルは異なる方法で報酬が得られます。",
        "p4": "また、クルミには「特殊な弾」のシステムもあり、ザフキエルの力を使って、自分や敵に効果を与えることができます。この特殊な弾を発動するには、敵を倒してタイムバーを充填する必要があります。特殊な弾には回復、速さ向上、クローン生成、時間停止などさまざまな効果があります。",
        "p5": "ゲームには記録に基づいたアップグレードと報酬のシステムも組み込まれています。",
        "subtitle3": "時崎狂三の3Dモデル",
        "p6": "この一時的なモデルは、vroidを使用して作成されましたが、後で変更される予定です。",
        "subtitle4": "アニメーション/エフェクツ/舞台音響",
        "p7": "アニメーションの作成にはCascadeurを、サウンドエフェクトの作成にはAudacityを使用しました。",
        "subtitle5": "シナリオ",
        "p8": "私はこのシナリオを最適化を念頭に置いて構築しました。GTX 1050 2gbで100 FPS以上で動作します。また、シナリオはモジュラー設計になっているため、アセットの簡単な拡張と再利用が可能です。",
        "subtitle6": "ツアンボス戦"
    },
    "Bakutara Bokaam": {
        "title": "バクタラ・ボカーン！！",
        "description": "私がチームを指揮しながら作成した最初のゲームです。他の人々もゲームで働くように指導しました。2週間で作られた無料でシンプルなゲームですが、アセットは別売りです。@Randamu3dModelsさんは爆タラの3Dモデルを担当し、@bigscaryindianさんはゲームの音楽を担当し、私はその他すべてを担当しました。これは最初から最後までプレイ可能な何かを作るという提案のプロジェクトであり、ウェブでプレイできます。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "ゲームプレイはシンプルで、爆弾が現れ、目標はできるだけ長い時間赤と黒に分けてから、スコアを使用して爆タラをカスタマイズすることです。",
        "label1": "ゲームプレイの動画は「Legend」によって2023年7月29日に録画されました。",
        "subtitle2": "ゲームのイラストとコンセプトアート",
        "p2": "また、ゲームのイラストとコンセプトアートも制作しました。"
    },
    "Unusual Scientist": {
        "title": "変な科学者",
        "description": "ソロで制作された、5日未満の期間でのゲームジャム用のゲーム。ウェブ上でプレイ可能です。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "上から見たシンプルなゲームで、スコアに基づくアーケードスタイルのゲームプレイです。プレイヤーはゾンビを倒し、アップグレードや異なる武器を手に入れる科学者としてプレイします。"
    },
    "Broken Bones": {
        "title": "ブローケン・ボーンズ",
        "description": "私の最初の商業リリースです。これはシンプルなゲームプレイと30のレベルを備えた携帯電話用のゲームです。3週間で制作されました。すでに1000以上のダウンロードを達成し、プレイストアで無料でダウンロードできます。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "目標は、バイクでレベルの終わりまで進み、頭を地面にぶつけずに各レベルの3つの追加の星を集めることです。これらの星を使って、キャラクターやバイクのカスタマイズ、さらには追加のレベルをアンロックできます。Broken Bonesのプレイストアでの評価平均は4.3です。"
    },
    "Multiplayer Project": {
        "title": "マルチプレイヤ・プロジェクト",
        "description": "マルチプレイヤ・プロジェクトは、より洗練されたゲームの作成と構造を学ぶためのプロジェクトでした。これはマルチメディアコースの最終プレゼンテーションプロジェクトでした。私はプロジェクトを通じて、プロジェクトのスケーリング方法、UnityとMirrorを使用したマルチプレイヤの実装、および完全なゲームに必要なすべてをどのように実装するかを学びました。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "主なゲームプレイは、多様な武器を備えたFPSマルチプレイヤでした。 \"HQ FPS Weapons\"、\"Subway / Metro / Train station Modular Pack\"、および \"Mixamo\"のアセットが使用されました。目標は、「HQ FPS Weapons」システムの機能を理解し、それを複製して、私のニーズに合わせて内容を追加および変更することでした。また、デザートポストアポカリプティックシナリオなどの写実的なアセットも作成しました。",
        "deletedContentTitle": "削除されたコンテンツ",
        "p2": "また、ゲームの途中でランダムなアイテムを提供する鍵も存在しました。それだけでなく、ゾンビも登場し、切断システムも実装されていましたが、これらはすべて取り除かれ、トレーラーには表示されませんでした。"
    },
    "Taiko No Tatsujin": {
        "title": "太鼓の達人: スクラッチ・エディション",
        "description": "私の最初のゲーム。それはスクラッチで作られました。基本的なゲーム制作を学ぶための制約のあるウェブサイトです。私はそれを完成させませんでしたが、5000人以上の人々がプレイしました。スクラッチで再現された『太鼓の達人』のゲームのバージョンです。",
        "subtitle": "ゲームのスクリーンショット",
        "p1": "このゲームは、スクラッチ用に作られた太鼓の達人のかなり未完成なバージョンです。カスタマイズや音楽の選択のオプションがあります。"
    },
    "S Prysm Destroyer": {
        "title": "S. Prysm Destroyer",
        "description": "コントラ風のアクションゲームで、メカと可愛いアニメ少女が登場します。イラスト、プログラミング、アニメーション、マーケティングキャンペーン、パブリッシングのすべてを、音楽を除いて私が担当しました。Steamでプレイ可能で、実績やハイスコア機能も搭載。『Situation Succ』のコラボもあります。",
        "subtitle": "ゲームスクリーンショット",
        "p1": "2Dのプラットフォームシューティングゲームで、とにかく破壊せよ！！ プリズムの力を手に入れて、アモルと共に人類に脅威をもたらす原初の敵を倒そう！ 可愛いコスチュームでおしゃれにプレイ！",
        "label1": "ビデオトレーラー",
        "subtitle2": "ゲームのメカニクス",
        "p2": "シンプルな操作性とスピーディーなアクションが特徴のゲームです。プレイヤーはジャンプ、射撃、そしてエレメンタルパワーを駆使して敵を倒します。さまざまな敵が登場し、それぞれ独自の攻撃パターンや弱点を持っています。",
        "p3": "ステージ内で一時的なアップグレードを獲得できるユニークなシステムを採用。高速移動を駆使することでコンボが発生し、プレイヤーに報酬が与えられます。さらに、飛行可能なジェットパックや、各ステージに存在する「プリズム」を発動させることで一定時間特別な力を得ることができます。",
        "subtitle3": "3Dモデル",
        "subtitle4": "変身アニメーション",
        "subtitle5": "ゲームプレイ動画",
        "label2": "「Twisted Banana Productions」によるビデオ（バージョン1.0.3）",
        "subtitle6": "Other Platforms"
    }  
}